SensorLogicInc/modules/slmx4_projects/button_demo2/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v10.0
processor: MIMXRT1062xxxxA
package_id: MIMXRT1062DVJ6A
mcu_data: ksdk2_0
processor_version: 10.0.0
pin_labels:
- {pin_num: H2, pin_signal: GPIO_SD_B0_04, label: DAT2, identifier: DAT2}
- {pin_num: K1, pin_signal: GPIO_SD_B0_03, label: DAT1, identifier: DAT1}
- {pin_num: J1, pin_signal: GPIO_SD_B0_02, label: DAT0, identifier: DAT0}
- {pin_num: J2, pin_signal: GPIO_SD_B0_05, label: DAT3, identifier: DAT3}
- {pin_num: J4, pin_signal: GPIO_SD_B0_00, label: CMD, identifier: CMD}
- {pin_num: J3, pin_signal: GPIO_SD_B0_01, label: CLK, identifier: CLK}
- {pin_num: L3, pin_signal: GPIO_SD_B1_06, label: CS, identifier: CS}
- {pin_num: L4, pin_signal: GPIO_SD_B1_07, label: CLK, identifier: CLK}
- {pin_num: P3, pin_signal: GPIO_SD_B1_08, label: IO0, identifier: IO0}
- {pin_num: N4, pin_signal: GPIO_SD_B1_09, label: IO1, identifier: IO1}
- {pin_num: P4, pin_signal: GPIO_SD_B1_10, label: IO2, identifier: IO2}
- {pin_num: P5, pin_signal: GPIO_SD_B1_11, label: IO3, identifier: IO3}
- {pin_num: N3, pin_signal: GPIO_SD_B1_05, label: DQS, identifier: DQS, comment: pin not on flash chip. floating to enable 133 MHz}
- {pin_num: L5, pin_signal: GPIO_SD_B1_00, label: WIFI_SDIO_D3, identifier: WIFI_SDIO_D3}
- {pin_num: M5, pin_signal: GPIO_SD_B1_01, label: WIFI_SDIO_D2, identifier: WIFI_SDIO_D2}
- {pin_num: M3, pin_signal: GPIO_SD_B1_02, label: WIFI_SDIO_D1, identifier: WIFI_SDIO_D1}
- {pin_num: M4, pin_signal: GPIO_SD_B1_03, label: WIFI_SDIO_D0, identifier: WIFI_SDIO_D0}
- {pin_num: P2, pin_signal: GPIO_SD_B1_04, label: WIFI_SDIO_CLK, identifier: WIFI_SDIO_CLK}
- {pin_num: H13, pin_signal: GPIO_AD_B1_08, label: WIFI_SDIO_CMD, identifier: WIFI_SDIO_CMD}
- {pin_num: M11, pin_signal: GPIO_AD_B0_02, label: RED, identifier: RED}
- {pin_num: G11, pin_signal: GPIO_AD_B0_03, label: GREEN, identifier: GREEN}
- {pin_num: E14, pin_signal: GPIO_AD_B0_06, label: TMS, identifier: TMS}
- {pin_num: F12, pin_signal: GPIO_AD_B0_07, label: TCK, identifier: TCK}
- {pin_num: F13, pin_signal: GPIO_AD_B0_08, label: MOD, identifier: MOD}
- {pin_num: F14, pin_signal: GPIO_AD_B0_09, label: TDI, identifier: TDI}
- {pin_num: G13, pin_signal: GPIO_AD_B0_10, label: TDO, identifier: TDO}
- {pin_num: G10, pin_signal: GPIO_AD_B0_11, label: TRST, identifier: TRST}
- {pin_num: K14, pin_signal: GPIO_AD_B0_12, label: BT_UART_RXD, identifier: BT_UART_RXD}
- {pin_num: L14, pin_signal: GPIO_AD_B0_13, label: BT_UART_TXD, identifier: BT_UART_TXD}
- {pin_num: L10, pin_signal: GPIO_AD_B0_15, label: BT_UART_RTS, identifier: BT_UART_RTS}
- {pin_num: H14, pin_signal: GPIO_AD_B0_14, label: BT_UART_CTS, identifier: BT_UART_CTS}
- {pin_num: J11, pin_signal: GPIO_AD_B1_00, label: SCL, identifier: SCL}
- {pin_num: K11, pin_signal: GPIO_AD_B1_01, label: SDA, identifier: SDA}
- {pin_num: L11, pin_signal: GPIO_AD_B1_02, label: UART2_TX, identifier: UART2_TX}
- {pin_num: L12, pin_signal: GPIO_AD_B1_04, label: WIDI_SDIO_D0, identifier: WIDI_SDIO_D0}
- {pin_num: K12, pin_signal: GPIO_AD_B1_05, label: WIDI_SDIO_D1, identifier: WIDI_SDIO_D1}
- {pin_num: J12, pin_signal: GPIO_AD_B1_06, label: WIDI_SDIO_D2, identifier: WIDI_SDIO_D2}
- {pin_num: K10, pin_signal: GPIO_AD_B1_07, label: WIDI_SDIO_D3, identifier: WIDI_SDIO_D3}
- {pin_num: F11, pin_signal: GPIO_AD_B0_04, label: D9, identifier: D9}
- {pin_num: M13, pin_signal: GPIO_AD_B1_09, label: WIFI_SDIO_CLK, identifier: WIFI_SDIO_CLK}
- {pin_num: L13, pin_signal: GPIO_AD_B1_10, label: SD_PWR_EN, identifier: SD_PWR_EN, comment: relocated from M13 on ep0}
- {pin_num: J13, pin_signal: GPIO_AD_B1_11, label: D6, identifier: D6}
- {pin_num: H12, pin_signal: GPIO_AD_B1_12, label: SD_CD_SW, identifier: SD_CD_SW, comment: Not sure if needed. Put it there to match the evk example...}
- {pin_num: H11, pin_signal: GPIO_AD_B1_13, label: D4, identifier: D4}
- {pin_num: G12, pin_signal: GPIO_AD_B1_14, label: SENSOR_EN, identifier: SENSOR_EN}
- {pin_num: J14, pin_signal: GPIO_AD_B1_15, label: BT_WAKE, identifier: BT_WAKE}
- {pin_num: C8, pin_signal: GPIO_B0_04, label: GPIO1, identifier: GPIO1}
- {pin_num: B8, pin_signal: GPIO_B0_05, label: GPIO2, identifier: GPIO2}
- {pin_num: A8, pin_signal: GPIO_B0_06, label: EN, identifier: EN}
- {pin_num: E7, pin_signal: GPIO_B0_01, label: SPI_MISO, identifier: SPI_MISO}
- {pin_num: D8, pin_signal: GPIO_B0_03, label: SPI_SCLK, identifier: SPI_SCLK}
- {pin_num: D7, pin_signal: GPIO_B0_00, label: SPI_CS, identifier: SPI_CS}
- {pin_num: E8, pin_signal: GPIO_B0_02, label: SPI_MOSI, identifier: SPI_MOSI}
- {pin_num: A9, pin_signal: GPIO_B0_07, label: PWMR, identifier: PWMR}
- {pin_num: C9, pin_signal: GPIO_B0_09, label: PWMB, identifier: PWMB}
- {pin_num: A10, pin_signal: GPIO_B0_11, label: PWMG, identifier: PWMG}
- {pin_num: B14, pin_signal: GPIO_B1_15, label: USER_BUTTON2, identifier: FACRESET_BUTTON;USER_BUTTON2}
- {pin_num: D10, pin_signal: GPIO_B0_13, label: MCKI, identifier: MCKI}
- {pin_num: A11, pin_signal: GPIO_B1_00, label: GPIO4, identifier: SDTO;GPIO4}
- {pin_num: B11, pin_signal: GPIO_B1_01, label: GPIO3, identifier: SDTI;GPIO3}
- {pin_num: C11, pin_signal: GPIO_B1_02, label: SPI_CS2, identifier: BICK;SPI_CS2}
- {pin_num: D11, pin_signal: GPIO_B1_03, label: SPI_CS1, identifier: FCK;SPI_CS1}
- {pin_num: E12, pin_signal: GPIO_B1_04, label: HTS221_DRDY, identifier: HTS221_DRDY}
- {pin_num: D12, pin_signal: GPIO_B1_05, label: PDN, identifier: PDN}
- {pin_num: C12, pin_signal: GPIO_B1_06, label: WL_SDIO_HOSTWAKE, identifier: WL_SDIO_HOSTWAKE}
- {pin_num: B12, pin_signal: GPIO_B1_07, label: BT_HOSTWAKE, identifier: BT_HOSTWAKE}
- {pin_num: A12, pin_signal: GPIO_B1_08, label: ALS_INT, identifier: ALS_INT}
- {pin_num: A13, pin_signal: GPIO_B1_09, label: WL_REG_ON, identifier: WL_REG_ON}
- {pin_num: B13, pin_signal: GPIO_B1_10, label: BT_REG_ON, identifier: BT_REG_ON}
- {pin_num: C13, pin_signal: GPIO_B1_11, label: WIFI_GPIO2, identifier: WIFI_GPIO2}
- {pin_num: D13, pin_signal: GPIO_B1_12, label: CD, identifier: CD}
- {pin_num: C14, pin_signal: GPIO_B1_14, label: WIFI_GPIO3, identifier: WIFI_GPIO3}
- {pin_num: D14, pin_signal: GPIO_B1_13, label: WDOG, identifier: WDOG}
- {pin_num: E3, pin_signal: GPIO_EMC_00, label: DATA00, identifier: DATA00}
- {pin_num: F3, pin_signal: GPIO_EMC_01, label: DATA01, identifier: DATA01}
- {pin_num: F4, pin_signal: GPIO_EMC_02, label: DATA02, identifier: DATA02}
- {pin_num: G4, pin_signal: GPIO_EMC_03, label: DATA03, identifier: DATA03}
- {pin_num: F2, pin_signal: GPIO_EMC_04, label: DATA04, identifier: DATA04}
- {pin_num: G5, pin_signal: GPIO_EMC_05, label: DATA05, identifier: DATA05}
- {pin_num: H5, pin_signal: GPIO_EMC_06, label: DATA06, identifier: DATA06}
- {pin_num: H4, pin_signal: GPIO_EMC_07, label: DATA07, identifier: DATA07}
- {pin_num: C6, pin_signal: GPIO_EMC_30, label: DATA08, identifier: DATA08}
- {pin_num: C5, pin_signal: GPIO_EMC_31, label: DATA09, identifier: DATA09}
- {pin_num: D5, pin_signal: GPIO_EMC_32, label: DATA10, identifier: DATA10}
- {pin_num: C4, pin_signal: GPIO_EMC_33, label: DATA11, identifier: DATA11}
- {pin_num: D4, pin_signal: GPIO_EMC_34, label: DATA12, identifier: DATA12}
- {pin_num: E5, pin_signal: GPIO_EMC_35, label: DATA13, identifier: DATA13}
- {pin_num: C3, pin_signal: GPIO_EMC_36, label: DATA14, identifier: DATA14}
- {pin_num: E4, pin_signal: GPIO_EMC_37, label: DATA15, identifier: DATA15}
- {pin_num: C2, pin_signal: GPIO_EMC_09, label: ADDR00, identifier: ADDR00}
- {pin_num: G1, pin_signal: GPIO_EMC_10, label: ADDR01, identifier: ADDR01}
- {pin_num: G3, pin_signal: GPIO_EMC_11, label: ADDR02, identifier: ADDR02}
- {pin_num: H1, pin_signal: GPIO_EMC_12, label: ADDR03, identifier: ADDR03}
- {pin_num: A6, pin_signal: GPIO_EMC_13, label: ADDR04, identifier: ADDR04}
- {pin_num: B6, pin_signal: GPIO_EMC_14, label: ADDR05, identifier: ADDR05}
- {pin_num: B1, pin_signal: GPIO_EMC_15, label: ADDR06, identifier: ADDR06}
- {pin_num: A5, pin_signal: GPIO_EMC_16, label: ADDR07, identifier: ADDR07}
- {pin_num: A4, pin_signal: GPIO_EMC_17, label: ADDR08, identifier: ADDR08}
- {pin_num: B2, pin_signal: GPIO_EMC_18, label: ADDR09, identifier: ADDR09}
- {pin_num: G2, pin_signal: GPIO_EMC_23, label: ADDR10, identifier: ADDR10}
- {pin_num: B4, pin_signal: GPIO_EMC_19, label: ADDR11, identifier: ADDR11}
- {pin_num: C1, pin_signal: GPIO_EMC_21, label: BA0, identifier: BA0}
- {pin_num: F1, pin_signal: GPIO_EMC_22, label: BA1, identifier: BA1}
- {pin_num: D3, pin_signal: GPIO_EMC_24, label: CAS, identifier: CAS}
- {pin_num: D2, pin_signal: GPIO_EMC_25, label: RAS, identifier: RAS}
- {pin_num: B3, pin_signal: GPIO_EMC_26, label: CLK, identifier: CLK}
- {pin_num: A2, pin_signal: GPIO_EMC_27, label: CKE, identifier: CKE}
- {pin_num: E1, pin_signal: GPIO_EMC_29, label: CS, identifier: CS}
- {pin_num: D1, pin_signal: GPIO_EMC_28, label: WE, identifier: WE}
- {pin_num: D6, pin_signal: GPIO_EMC_38, label: DM1, identifier: DM1}
- {pin_num: H3, pin_signal: GPIO_EMC_08, label: DM0, identifier: DM0}
- {pin_num: M12, pin_signal: GPIO_AD_B1_03, label: UART2_RX, identifier: UART2_RX}
- {pin_num: H10, pin_signal: GPIO_AD_B0_01, label: ID, identifier: ID}
- {pin_num: M8, pin_signal: USB_OTG1_DN, label: DM, identifier: DM}
- {pin_num: L8, pin_signal: USB_OTG1_DP, label: DP, identifier: DP}
- {pin_num: M14, pin_signal: GPIO_AD_B0_00, label: USER_BUTTON1, identifier: SLEEPAIR_BUTTON;USER_BUTTON1}
- {pin_num: B7, pin_signal: GPIO_EMC_39, label: DQS, identifier: DQS}
- {pin_num: C7, pin_signal: GPIO_EMC_41, label: VSELECT, identifier: VSELECT}
power_domains: {DCDC_IN: '3.3', DCDC_IN_Q: '3.3', DCDC_LP: '1.15', DCDC_PSWITCH: '3.3', DCDC_SENSE: '1.15', NVCC_EMC: '3.3', NVCC_GPIO: '3.3', NVCC_PLL: '1.1', NVCC_SD0: '3.3',
  NVCC_SD1: '3.3', VDDA_ADC_3P3: '3.3', VDD_HIGH_CAP: '2.5', VDD_HIGH_IN: '3.3', VDD_SNVS_CAP: '3.3', VDD_SNVS_IN: '3.3', VDD_SOC_IN: '1.15', VDD_USB_CAP: '3.3'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

